atomiechen/PressureSense/nRF52832/nRF52832_Slave_ADG725_DFU/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ADG725/main.c
    switch (pin_no)
    {
        case LEDBUTTON_BUTTON:
            NRF_LOG_INFO("Send button state change.");
            //err_code = ble_lbs_on_button_change(m_conn_handle, &m_lbs, button_action);
            if (err_code != NRF_SUCCESS &&
                err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                err_code != NRF_ERROR_INVALID_STATE &&
                err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        default:
            APP_ERROR_HANDLER(pin_no);
            break;
    }
}


/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
    ret_code_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {LEDBUTTON_BUTTON, false, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, ARRAY_SIZE(buttons),
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
}


static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}




int counttx=0;
uint8_t  DataRead[256];
uint8_t  DataRead_short[224];
volatile nrf_saadc_value_t out_voltage;
volatile uint8_t cnt = 0;


void saadc_callback(nrf_drv_saadc_evt_t const * p_event)
{
//   
}

void saadc_init(void)
{
    ret_code_t err_code;
    nrf_saadc_channel_config_t channel_config =
            NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN3);
    err_code = nrf_drv_saadc_init(NULL, saadc_callback);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_channel_init(0, &channel_config);
    APP_ERROR_CHECK(err_code);

}

void saadc_init_quick_sample(void)
{
    ret_code_t err_code;
    nrf_saadc_channel_config_t channel_config =
            NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN3);
	// add by cwh
		channel_config.acq_time = NRF_SAADC_ACQTIME_3US;
    err_code = nrf_drv_saadc_init(NULL, saadc_callback);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_channel_init(0, &channel_config);
    APP_ERROR_CHECK(err_code);

}

#define CSA 6
#define CSB 5
static void thi_monitor_handler(void)
{
	// 如果已经连接上，则上传数据到主机，否则不执行后面的操作
	if(m_conn_handle == BLE_CONN_HANDLE_INVALID) {
		return;
	}

		uint8_t reg_x = (1<<CSB);
	  // uint16_t matrix_scan=0;
		for(int i=0;i<16;i++){
			set_mux(reg_x);
			uint8_t reg_y = (1<<CSA);
			// matrix_scan=0;
			for(int k=0;k<16;k++){
				set_mux(reg_y);
				reg_y++;
				
				nrf_saadc_value_t saadc_val=0;
				nrf_drv_saadc_sample_convert(0,&saadc_val);
        DataRead[16*i+k]=saadc_val;

				// NRF_LOG_INFO("## start sample cnt = %d", (int)cnt);
    //     cnt = 0;
    //     nrf_drv_saadc_sample();
    //     while (cnt == 0) {} // wait for adc
				// NRF_LOG_INFO("## cnt = %d", (int)cnt);
				// DataRead[16*i+k] = out_voltage;
			}

			reg_x++;
		}
		
		//截短DataRead
		for(int i=0;i<256;i+=8){
			for(int j=0;j<7;j++){
				uint8_t now=DataRead[i+j],next = DataRead[i+j+1];
				DataRead_short[i/8*7 + j] = ((now>>1)<<(j+1))|(next>>(7-j));
			}
		}
	//	if(m_conn_handle!=BLE_CONN_HANDLE_INVALID)
	//	{
	//		ble_lbs_on_button_change1(m_conn_handle, &m_lbs, DataRead);
	//	}
		
			ble_lbs_on_button_change1(m_conn_handle, &m_lbs, DataRead_short);
			
			// add by cwh
			static int count = 0;
			count++;
			if (count == 200) {
				NRF_LOG_INFO("send 200 times");
				count = 0;
			}
}

//定时器超时中断操作
static void thi_monitor_timeout_handler(nrf_timer_event_t event_type,void * p_context)
{
	    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE2:
						thi_monitor_handler();
            break;

        default:
            //Do nothing.
            break;
    }

}
/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init1(void)
{
	  uint32_t err_code;
    // Initialize timer module, making it use the scheduler
		// APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
	
	  // 创建一个周期执行的定时器，用于触发AD
    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    timer_cfg.bit_width = NRF_TIMER_BIT_WIDTH_32;
    err_code = nrf_drv_timer_init(&m_timer, &timer_cfg, thi_monitor_timeout_handler);
    APP_ERROR_CHECK(err_code);
}


//定时器开始计时，时间间隔 __ ms
/**@brief Function for starting application timers.
 */
static void application_timers_start(void)
{
    uint32_t ticks = nrf_drv_timer_ms_to_ticks(&m_timer, 10);
    nrf_drv_timer_extended_compare(&m_timer,
                                   NRF_TIMER_CC_CHANNEL2,
                                   ticks,
                                   NRF_TIMER_SHORT_COMPARE2_CLEAR_MASK,
                                   true);
    nrf_drv_timer_enable(&m_timer);
}

#define SAMPLES_IN_BUFFER 1
// volatile uint8_t state = 1;

// static const nrf_drv_timer_t m_timer = NRF_DRV_TIMER_INSTANCE(0);
static nrf_saadc_value_t     m_buffer_pool[1][SAMPLES_IN_BUFFER];
static nrf_ppi_channel_t     m_ppi_channel;
static uint32_t              m_adc_evt_counter;

void timer_handler(nrf_timer_event_t event_type, void * p_context)
{

}


void saadc_sampling_event_init(void)
{
    ret_code_t err_code;

    err_code = nrf_drv_ppi_init();
    APP_ERROR_CHECK(err_code);

    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    timer_cfg.bit_width = NRF_TIMER_BIT_WIDTH_32;
    err_code = nrf_drv_timer_init(&m_timer, &timer_cfg, timer_handler);
    APP_ERROR_CHECK(err_code);

    /* setup m_timer for compare event every __ ms/us */
    // 设置定时，捕获/比较通道，比较值，清除比较任务，关闭时钟中断
    uint32_t ticks = nrf_drv_timer_us_to_ticks(&m_timer, 25);
    nrf_drv_timer_extended_compare(&m_timer,
                                   NRF_TIMER_CC_CHANNEL2,
                                   ticks,
                                   NRF_TIMER_SHORT_COMPARE2_CLEAR_MASK,
                                   false);
    nrf_drv_timer_enable(&m_timer);

    // 设置PPI两端的通道，一个是比较事件，一个是adc采集任务
    uint32_t timer_compare_event_addr = nrf_drv_timer_compare_event_address_get(&m_timer,
                                                                                NRF_TIMER_CC_CHANNEL2);
    uint32_t saadc_sample_task_addr   = nrf_drv_saadc_sample_task_get();

    /* setup ppi channel so that timer compare event is triggering sample task in SAADC */
    err_code = nrf_drv_ppi_channel_alloc(&m_ppi_channel);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_ppi_channel_assign(m_ppi_channel,
                                          timer_compare_event_addr,
                                          saadc_sample_task_addr);
    APP_ERROR_CHECK(err_code);
}


void saadc_sampling_event_enable(void)
{
    // 使能PPI通道
    ret_code_t err_code = nrf_drv_ppi_channel_enable(m_ppi_channel);

    APP_ERROR_CHECK(err_code);
}

int i = 0;
int k = 0;
uint8_t reg_x = (1<<CSB);
uint8_t reg_y = (1<<CSA);

