atomiechen/PressureSense/nRF52832/nRF52832_Slave_ADG725_DFU/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ADG725/main.c
void loop_init(void) {
  i = 0;
  k = 0;
  reg_x = (1<<CSB);
  reg_y = (1<<CSA);
  set_mux(reg_x);
  set_mux(reg_y);
}

void send_data(void) {
	//截短DataRead
	for(int i=0;i<256;i+=8){
		for(int j=0;j<7;j++){
			uint8_t now=DataRead[i+j],next = DataRead[i+j+1];
			DataRead_short[i/8*7 + j] = ((now>>1)<<(j+1))|(next>>(7-j));
		}
	}

	// 上传数据到主机
	ble_lbs_on_button_change1(m_conn_handle, &m_lbs, DataRead_short);
	
	// add by cwh
	static int count = 0;
	count++;
	if (count == 200) {
		NRF_LOG_INFO("send 200 times");
		count = 0;
	}
}

void saadc_callback2(nrf_drv_saadc_evt_t const * p_event)
{
    // adc采集中断回调函数

    if (p_event->type == NRF_DRV_SAADC_EVT_DONE)
    {
        ret_code_t err_code;

				// 为下次采样准备好缓存
        err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, SAMPLES_IN_BUFFER);
        APP_ERROR_CHECK(err_code);

        // 未连接蓝牙，则不向下执行
        if(m_conn_handle == BLE_CONN_HANDLE_INVALID) {
            loop_init();
            return;
        }

				// 读取adc采样转换值
        nrf_saadc_value_t saadc_val = p_event->data.done.p_buffer[0];
				if (saadc_val < 0) {
					DataRead[16*i+k] = 0;
				} else if (saadc_val > 255) {
					DataRead[16*i+k] = 255;
				} else {
					DataRead[16*i+k] = saadc_val;
				}
				

				// NRF_LOG_INFO("i=%d  k=%d", i, k);
				
        k++;
        if (k == 16) {
					i++;
          if (i == 16) {
            send_data();
            loop_init();
          } else {
            k = 0;
            reg_y = (1<<CSA);
            reg_x++;
            set_mux(reg_x);
            set_mux(reg_y);
          }
        } else {
          // reg_y++;
					uint8_t tmp = reg_y & 0x0F;
					if (tmp > 7) {
						reg_y--;
					} else if (tmp == 7) {
						reg_y = (1<<CSA) + 15;
					} else {
						reg_y++;
					}
          set_mux(reg_y);
        }
    }
}


void saadc_init_ppi(void)
{
    ret_code_t err_code;
    nrf_saadc_channel_config_t channel_config =
        NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN3);

	// add by cwh
		// channel_config.acq_time = NRF_SAADC_ACQTIME_5US;

    err_code = nrf_drv_saadc_init(NULL, saadc_callback2);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_channel_init(0, &channel_config);
    APP_ERROR_CHECK(err_code);

    // 配置一个缓冲
    err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[0], SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);

		// 配置第二个缓冲
    // err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[1], SAMPLES_IN_BUFFER);
    // APP_ERROR_CHECK(err_code);

    loop_init();
}

void saadc_callback_out(nrf_drv_saadc_evt_t const * p_event)
{
    if (p_event->type == NRF_DRV_SAADC_EVT_DONE)
    {
        // NRF_LOG_INFO("## saadc int start");
        ret_code_t err_code;

        // 为下次采样准备好缓存
        err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, SAMPLES_IN_BUFFER);
        APP_ERROR_CHECK(err_code);

        // 读取adc采样转换值
        out_voltage = p_event->data.done.p_buffer[0];
        cnt += 1;

        NRF_LOG_INFO("## saadc int end");
    }
}

void saadc_init_out(void)
{
    ret_code_t err_code;
    nrf_saadc_channel_config_t channel_config =
            NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN3);
  // add by cwh
    channel_config.acq_time = NRF_SAADC_ACQTIME_3US;

    err_code = nrf_drv_saadc_init(NULL, saadc_callback_out);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_channel_init(0, &channel_config);
    APP_ERROR_CHECK(err_code);

    // 配置一个缓冲
    err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[0], SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);

  // // ref: https://devzone.nordicsemi.com/f/nordic-q-a/27747/saadc-using-local-timer
 //    uint32_t const numberOfSamples= 1;
 //    int16_t sampleBuffer[numberOfSamples]= {0};

  //   uint32_t samplingRate= 8000;
 //    NRF_SAADC->SAMPLERATE = (16000000/samplingRate);      // [80..2047] Capture and compare value. Sample rate is 16 MHz/CC
 //    NRF_SAADC->SAMPLERATE|= SAADC_SAMPLERATE_MODE_Timers  // Rate is controlled from local timer (use CC to control the rate)
 //                        << SAADC_SAMPLERATE_MODE_Pos;

 //    NRF_SAADC->RESULT.PTR = (uint32_t)sampleBuffer;
 //    NRF_SAADC->RESULT.MAXCNT = numberOfSamples;
    
  //  nrf_saadc_task_trigger(NRF_SAADC_TASK_START);
}

/**@brief Function for application main entry.
 */
int main(void)
{
    // Initialize.
    log_init();
    leds_init();

    timers_init();
    buttons_init();
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();

    ADG725_spi_init();

    // saadc_init();
    // // saadc_init_quick_sample();
    // // saadc_init_out();
    // timers_init1();
    // application_timers_start();

    saadc_init_ppi();
    saadc_sampling_event_init();
    saadc_sampling_event_enable();

    services_init();
    advertising_init();
    conn_params_init();

    // Start execution.
    NRF_LOG_INFO("ADG725 example started.");
    advertising_start();

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
